---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MassFailures.CannotMergeGeometry
source: html/3d161566-8205-4056-521f-b0a868290170.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MassFailures.CannotMergeGeometry Property

The Mass contains geometry that cannot be combined. Mass Floors, volume, and surface area, won't be computed.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotMergeGeometry { get; }
```